live/04_refs_complex_structures/references_complex_structures.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>References and Complex Data structures</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="References and Complex Data structures"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-19 08:18:13 AST"/>
<meta name="author" content="Heikki Lehvaslaiho"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">References and Complex Data structures</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 References</a>
<ul>
<li><a href="#sec-1-1">1.1 What are references?</a></li>
<li><a href="#sec-1-2">1.2 Array references</a></li>
<li><a href="#sec-1-3">1.3 Hash References</a></li>
<li><a href="#sec-1-4">1.4 Other references</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> References</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What are references?</h3>
<div class="outline-text-3" id="text-1-1">


<p>
References allow you to have a "pointer" to something else, typically
a complex structure. Reference is stored in a scalar variable.
</p>



<pre class="example">use v5.10;
my $a = 'value';
say $a;
my $a_ref = \$a; # read \ as "reference to"

# dereferencing is done by repeating the type of the original
# variable
say ${$a_ref};   # "evaluate in scalar context"
say $$a_ref;     # shorter syntax

# how do you know what kind is the referred value?
my @a; my $array_ref = \@a;
my %a; my $hash_ref = \%a;

say ref $a_ref;
say ref $array_ref;
say ref $hash_ref;
</pre>


<pre class="example">
value
value
value
SCALAR
ARRAY
HASH
</pre>


<p>
Refrences can be created to values without intermediate
variables. These are known as <b>anonymous data structures</b>. Use square
bracket around the list to mark referring.
</p>



<pre class="example">$a = \'a';
print ref $a , "\n"; 
$az = ['a' .. 'z'];
print ref $az; 
</pre>


<pre class="example">
SCALAR
ARRAY
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Array references</h3>
<div class="outline-text-3" id="text-1-2">


<p>
By passing an array reference to a subroutine, you can keep arrays
intact. 
</p>
<p>
Benefit: You need not duplicate large data structures.
Possible catch: Modifying the referenced value inside the subroutine
changes the original!
</p>



<pre class="example">  use v5.10;
  my @list1 = qw( 3 5 7);
  my @list2 = qw( 9 2 4 5);

  sub count_arrays {
      my @counts;
      for (@_) {
          push @counts, scalar @$_;
          #pop @$_;
      }
      return @counts;
  }

  say join " ", count_arrays (\@list1, \@list2);
#  say join " ", count_arrays (\@list1, \@list2); # unexpected side effect
</pre>


<pre class="example">
3 4
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Hash References</h3>
<div class="outline-text-3" id="text-1-3">


<p>
References to hashes work exactly the same way as to arrays. The
references anonymous references use curly brackets.
</p>

<p>
Example how to code for chess board:
</p>



<pre class="example">use v5.10;
use Data::Dumper;
my $board;                      # scalar variable
my $piece = {color =&gt; 'white',  # hash reference
             piece =&gt; 'pawn'};

# place the pawn
$board-&gt;[0]-&gt;[1] = $piece;  # using the deference arrow
# same as:
$board[0][1] = $piece;  # autovivification

print Dumper $board;

# look up a location
my $p = $board[0][1];
print Dumper $p;
say $p-&gt;{piece};
say $board[0]-&gt;[1]-&gt;{piece};
say $board[0][1]{color};
say $board[0][0] || 'no piece on this location';
if (my $loc = $board[0][1] )  {
   say $loc-&gt;{piece}, ", ", $loc-&gt;{color};
} else {
   say 'no piece on this location';
}

</pre>



<pre class="example">$VAR1 = [
          [
            undef,
            {
              'piece' =&gt; 'pawn',
              'color' =&gt; 'white'
            }
          ]
        ];
$VAR1 = {
          'piece' =&gt; 'pawn',
          'color' =&gt; 'white'
        };
pawn
pawn
white
no piece on this location
pawn, white
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Other references</h3>
<div class="outline-text-3" id="text-1-4">



<p>
Modern perls (&gt;=v5.14) know of other references, too. Only code
references have been used for a long time.
</p>




<pre class="example">use v5.10;
sub greet {
    my $greeting = "Hello!";
    say $greeting;
}
my $g = \&amp;greet;
$g-&gt;();

my $g2 = sub {$n = shift; say "Hello, $n"};
$g2-&gt;('you');
</pre>


<pre class="example">
Hello!
Hello, you
</pre>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-19 08:18:13 AST</p>
<p class="author">Author: Heikki Lehvaslaiho</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
